Case_n0_75/Case_a0_25/Case_lc0_01/constant/porosityProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      porosityProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
//
n 0.75;
T 0.7;
um 0.78 ;
d 0.0159;
KC #eval{($T * $um)/($d * $n)};

porosityModel JensenEtAl2014;

porosityEnabled true;

JensenEtAl2014Coeffs
{
    alpha 500;
    beta 2;
    gamma_p 0.34;
    d50 0.0159;
    KC $KC; 
}

// ************************************************************************* //
